Revit 2027 API
AnalysisResultSchema(AnalysisResultSchema) Constructor
 Constructs a new copy of the input AnalysisResultSchema object.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AnalysisResultSchema(
	AnalysisResultSchema other
)
Public Sub New (
	other As AnalysisResultSchema
)
public:
AnalysisResultSchema(
	AnalysisResultSchema^ other
)
new :
        other : AnalysisResultSchema -> AnalysisResultSchema
Parameters
other AnalysisResultSchema
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
AnalysisResultSchema Class
AnalysisResultSchema Overload
Autodesk.Revit.DB.Analysis Namespace